Revit 2024 API
FilledRegion.CreateMaskingRegion Method
Overload List
Name | Description
CreateMaskingRegion(Document, ElementId, IList<CurveLoop>)
 Creates a view-specific masking region from the given boundaries.
CreateMaskingRegion(Document, SketchPlane, IList<CurveLoop>)
 Creates a masking region on a sketch plane in a 3d model family.
See Also
FilledRegion Class
FilledRegion Members
Autodesk.Revit.DB Namespace